#include <stdio.h>
#define _CRT_SECURE_NO_WARNINGS
#include <locale.h>
#include <math.h>

int main()
{
    setlocale(LC_ALL, "RUS");

    printf("123\n"); //подзадание 1
    printf("1\n2\n3\n"); //подзадание 2
    printf("1\n \t2\n \t\t3\n"); //подзадание 3
    printf("%1d\n %2d\n %3d\n %4d\n", 1, 2, 3, 4); //подзадание 4
    printf("%10.3f\n ", 12.234657); //подзадание 5
    printf("%10.5f\n ", 12.234657); //подзадание 6
    printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); //подзадание 7
    printf("7/5 = %d\n", 7 / 5); //подзадание 8
    printf("2000*4 = %d\n", 2000 * 4); //подзадание 9 
    printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); //подзадание 10
    printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000); //подзадание 10 с спецификатором %d
    printf("%f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000); //подзадание 10 с спецификатором %f
    printf("%g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000); //подзадание 10 с спецификатором %g
    printf("%e разделить %e равно %e\n\n\n ", 5., 2000000., 5. / 2000000); //подзадание 10 с спецификатором %e

    int N, K;
    N = 23;
    K = 21;

    printf("сейчас %d часов %d минут 00 секунд\n", N, K);
    printf("идёт %d минута суток\n", N * 60 + K);
    printf("до полуночи осталось %d часов и %d минут\n", 23 - N, 59 - K);
    printf("с 8:00 прошло %d секунд\n", (N - 8) * 3600 + K * 60);
    printf("текущий час = %.2f суток и текущая минута = %.2f часа\n\n\n", N / 24.0, K / 60.0);

    int n = 3;
    int L = 333;
    int k = 3;
    int m = 3;

    printf("дано:\n");
    printf("%5d\n", n);
    printf("%5d\n", L);
    printf("________\n");
    printf("ответ:\n");
    printf("% +08.3f\n", (double)n/L);
}